Revit 2027 API
CompoundStructure.ClearWallSweeps Method
 Removes all sweeps or reveals from the compound structure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ClearWallSweeps(
	WallSweepType wallSweepType
)
Public Sub ClearWallSweeps (
	wallSweepType As WallSweepType
)
public:
void ClearWallSweeps(
	WallSweepType wallSweepType
)
member ClearWallSweeps :
        wallSweepType : WallSweepType -> unit
Parameters
wallSweepType WallSweepType
 The type of a wall sweep.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
InvalidOperationException |  This operation is valid only for vertically compound structures.
See Also
Reference
CompoundStructure Class
Autodesk.Revit.DB Namespace